[
  {
    "Title": "Езда по прямой",
    "Command": "RobotGo",
    "Image": "AnimatedVisuals::RobotGoAnim",
    "TextSound": "<speak version=\"1.0\" xml:lang=\"ru-RU\">Следите за дорогой и не делайте резких движений рулём.</speak>",
    "Steps": [
      {
        "Name": "Первый шаг",
        "Description": "Выехать"
      },
      {
        "Name": "Второй шаг",
        "Description": "Ехать"
      },
      {
        "Name": "Третий шаг",
        "Description": "Доехать"
      }
    ]
  },
  {
    "Title": "Начало движения",
    "Command": "Start",
    "Image": "Assets/Video/Start.mp4",
    "TextSound": "<speak version=\"1.0\" xml:lang=\"ru-RU\">Перед началом движения выполните все подготовительные действия. <break time=\"500ms\"/> Сначала сядьте в автомобиль, отрегулируйте сиденье и зеркала под себя. <break time=\"400ms\"/> Пристегните ремень безопасности. <break time=\"400ms\"/> Убедитесь, что рычаг коробки передач находится в нейтральном положении. <break time=\"400ms\"/> Включите зажигание и проверьте, что все приборы работают исправно. <break time=\"400ms\"/> Нажмите на педаль тормоза, включите левый поворотник и, убедившись в безопасности, начинайте движение.</speak>",
    "Steps": [
      {
        "Name": "Проверка сиденья и зеркал",
        "Description": "Отрегулируйте сиденье, спинку и зеркала так, чтобы было удобно и безопасно управлять автомобилем."
      },
      {
        "Name": "Ремень безопасности",
        "Description": "Пристегните ремень безопасности. Убедитесь, что он не перекручен и плотно прилегает к телу."
      },
      {
        "Name": "Положение рычага",
        "Description": "Проверьте, что рычаг КПП стоит на нейтральной передаче (или в режиме P для автоматов)."
      },
      {
        "Name": "Проверка приборов",
        "Description": "Включите зажигание, убедитесь в исправности приборов и отсутствии ошибок на панели."
      },
      {
        "Name": "Начало движения",
        "Description": "Нажмите на тормоз, включите левый поворотник, убедитесь в безопасности и начинайте движение."
      }
    ]
  },
  {
    "Title": "Робот спит",
    "Command": "Sleep",
    "Image": "Assets/RobotSleep.png",
    "TextSound": "<speak version=\"1.0\" xml:lang=\"ru-RU\">Загрузи́те программу в ро́бот и запусти́те её.</speak>",
    "Steps": [
      {
        "Name": "Загрузка программы",
        "Description": "Загрузите программу согласно дукоментации к роботу в github (ссылка в \"о программе\")"
      },
      {
        "Name": "Запуск программы",
        "Description": "Включите робота, откройте 8 слот и запустите программу"
      }
    ]
  },
  {
    "Title": "Hollow Knight",
    "Command": "HK",
    "Image": "Assets/Video/Hollow knight.mp4",
    "TextSound": "",
    "Steps": [
      {
        "Name": "Скачать",
        "Description": ""
      },
      {
        "Name": "Играть",
        "Description": ""
      }
    ]
  },
  {
    "Title": "Поворот налево",
    "Command": "TurnLeft",
    "Image": "Assets/Video/Turn.mp4",
    "TextSound": "<speak version=\"1.0\" xml:lang=\"ru-RU\">Перед поворотом налево необходимо занять нужное положение на полосе, включить сигнал поворота, убедиться в безопасности и плавно повернуть руль на угол девяносто градусов. После завершения манёвра — выровняться и продолжить движение.</speak>",
    "Steps": [
      {
        "Name": "Первый шаг",
        "Description": "Убедитесь, что вы находитесь в нужной позиции для поворота."
      },
      {
        "Name": "Второй шаг",
        "Description": "Убедитесь, что нет препятствий слева."
      },
      {
        "Name": "Третий шаг",
        "Description": "Включите сигнал поворота налево"
      },
      {
        "Name": "Четвертый шаг",
        "Description": "Уменьшите скорость перед поворотом"
      },
      {
        "Name": "Пятый шаг",
        "Description": "Поверните влево под углом 90 градусов"
      },
      {
        "Name": "Шестой шаг",
        "Description": "Убедитесь, что вы полностью завершили поворот и находитесь на новой траектории"
      },
      {
        "Name": "Седьмой шаг",
        "Description": "Увеличьте скорость и продолжайте движение."
      }
    ]
  },
  {
    "Title": "Заезд в гараж/Выезд из гаража",
    "Command": "Garage",
    "Image": "Assets/Video/Garage.mp4",
    "TextSound": "<speak version=\"1.0\" xml:lang=\"ru-RU\">При заезде в гараж важно контролировать дистанции и углы поворота. Используйте зеркала, двигайтесь медленно, корректируйте направление. При выезде — убедитесь в безопасности и плавно возвращайтесь на дорогу.</speak>",
    "Steps": [
      {
        "Name": "Подъехать к гаражу сбоку/Оценить пространство",
        "Description": "Убедитесь, что гараж и пространство сзади свободны. Включите задний ход/Убедиться, что двери гаража открыты полностью и не будут мешать движению. Ворота следует закрепить на засов, который находится в нижнем углу ворот."
      },
      {
        "Name": "Включить сигнал поворота",
        "Description": "максимально выкрутить руль в сторону от парковочного места и медленно начать движение. Остановиться, когда будет виден край гаража или стойка ворот, которую нужно огибать/Включите сигнал поворота."
      },
      {
        "Name": "Вывернуть руль в сторону парковочного места/",
        "Description": "Включить заднюю передачу и двигаться назад, огибая угол гаража, пока борт авто не станет параллельно «стене» гаража/Вывернуть руль в сторону выезда до упора."
      },
      {
        "Name": "Выровнять колёса и заехать в гараж/Начать движение",
        "Description": "При необходимости поворачивайте рулем, чтобы направить авто в гараж. Постоянно проверяйте пространство сзади/Начать движение на минимальной скорости, постепенно выезжая переднюю часть автомобиля."
      },
      {
        "Name": "Продолжать движение",
        "Description": "Продолжать движение с вывернутыми колёсами, пока стойка кузова между передней и задней дверьми справа не поравняется с крайней левой точкой впереди стоящего автомобиля."
      },
      {
        "Name": "Повернуть руль вправо",
        "Description": "Повернуть руль вправо, чтобы установить передние колёса параллельно выезду"
      },
      {
        "Name": "Продолжать движение",
        "Description": "Продолжать движение, полностью выезжая из гаража и выравнивая автомобиль, постепенно возвращая руль влево в исходную позицию."
      }
    ]
  },
  {
    "Title": "Параллельная парковка",
    "Command": "ParallelPark",
    "Image": "Assets/Video/ParellPark.mp4",
    "TextSound": "<speak version=\"1.0\" xml:lang=\"ru-RU\">Параллельная парковка требует точности. Подъезжайте к машине спереди, включите сигнал, начните движение задним ходом, следите за ориентирами. Постепенно выравнивайте автомобиль и завершите манёвр, убедившись в правильности позиции.</speak>",
    "Steps": [
      {
        "Name": "Выбрать место",
        "Description": " Пространство для парковки должно быть длиннее автомобиля на 1,5–2 метра. Подъезжать нужно к машине, которая стоит впереди, и остановиться так, чтобы передняя ось находилась на уровне её заднего бампера. Расстояние между автомобилями — около 50–60 см. Включить сигнал поворота, чтобы предупредить других водителей/Включить сигнал поворота и повернуть руль максимально влево."
      },
      {
        "Name": "Подготовка к манёвру",
        "Description": "Включить заднюю передачу, повернуть руль примерно на 45° вправо (не до упора). Перед началом движения убедиться, что сзади нет машин, пешеходов или других препятствий/На минимальной скорости выезжать постепенно, пока правое крыло машины не окажется на полосе движения, на безопасном расстоянии от впереди стоящего автомобиля."
      },
      {
        "Name": "Начало движения задним ходом",
        "Description": "Медленно тронуться назад, следя за левым зеркалом. Когда заднее колесо машины окажется на уровне заднего бампера автомобиля впереди, начать выпрямлять руль. Важно не делать резких движений, чтобы автомобиль двигался по плавной траектории/Пропустить двигающийся транспорт, если он есть, и, выравнивая колёса, выехать."
      },
      {
        "Name": "Завершение парковки",
        "Description": "Когда задняя часть автомобиля начнёт уверенно заходить в парковочное место, а передняя будет ещё немного направлена в сторону дороги, повернуть руль влево и продолжать движение назад. Цель — встать параллельно бордюру на расстоянии 20–30 см. Если угол слишком острый, остановиться и немного подкорректировать положение."
      },
      {
        "Name": "Доработка позиции",
        "Description": "Если автомобиль встал неровно, аккуратно передвинуть его вперёд или назад, чтобы подкорректировать положение. Убедиться, что не мешаешь другим участникам движения и не задеваешь соседние автомобили."
      }
    ]
  },
  {

    "Title": "Заезд в гору/cъезд с горы",
    "Command": "Mountain",
    "Image": "Assets/Video/Mountain.mp4",
    "TextSound": "<speak version=\"1.0\" xml:lang=\"ru-RU\">Перед подъёмом на горку остановитесь у линии, плавно трогайтесь, не допускайте отката назад. На вершине остановитесь. При съезде контролируйте скорость и плавно тормозите, соблюдая траекторию движения.</speak>",
    "Steps": [
      {
        "Name": "Подъехать к месту на автодроме",
        "Description": "Подъехать к месту где оборудована искусственная горка, и остановиться у стартовой линии."
      },
      {
        "Name": "Начать движение",
        "Description": "Въехать на подъём и остановиться в обозначенном месте (стоп-линия)."
      },
      {
        "Name": "После остановки",
        "Description": "После полной остановки убрать ногу с педали тормоза и плавно нажать на газ."
      },
      {
        "Name": "Контролируйте обороты двигателя и скорость движения",
        "Description": "Контролируя обороты двигателя и скорость движения, въехать на верхнюю площадку и остановиться в обозначенном месте."
      },
      {
        "Name": "Съехать с горки",
        "Description": "Съедьте с горки и остановитесь уже у стоп-линии, обозначающей конец этапа."
      }
    ]
  },
  {
    "Title": "Конец движения",
    "Command": "End",
    "Image": "Assets/Video/End.mp4",
    "TextSound": "<speak version=\"1.0\" xml:lang=\"ru-RU\">По завершении упражнения аккуратно заедьте в отведённое место задним ходом, выровняйте автомобиль по зеркалам. Остановитесь у контрольной точки, включите стояночный тормоз и сообщите экзаменатору об окончании манёвра.</speak>",
    "Steps": [
      {
        "Name": "Отведнное место",
        "Description": "Аккуратно заехать задним ходом в отведённое место, контролируя движение с помощью рулевого колеса."
      },
      {
        "Name": "Выровнять автомобиль по зеркалам",
        "Description": "Выровнять автомобиль по зеркалам, если это необходимо"
      },
      {
        "Name": "Остановить автомобиль",
        "Description": "Остановите автомобиль до того, как задний бампер «коснётся» контрольной точки (например, линии между точками, обозначающими границы гаража)."
      },
      {
        "Name": "Выключить заднюю передачу",
        "Description": "включить стояночный тормоз и сказать экзаменатору, что выполнение упражнения завершено."
      },
      {
        "Name": "После команды экзаменатора покинуть парковочное место.",
        "Description": "Для этого нужно включить соответствующий команде сигнал поворота, убедиться в безопасности манёвра (посмотреть по сторонам) и ехать прямо, пока контрольная точка не окажется между передней и задней дверьми."
      },
      {
        "Name": "Повернуть руль до упора вправо.",
        "Description": "Поверните руль до упора вправо и покиньте парковочное место."
      }
    ]
  }
]